In [1]:
import pandas as pd
import numpy as np

In [2]:
s1=pd.Series(np.random.randint(1,high=5, size=100, dtype='I'))
s2=pd.Series(np.random.randint(1, high=4, size=100, dtype='I'))
s3=pd.Series(np.random.randint(10000, high=30001, size=100, dtype='I'))
print(s1,s2,s3)

0     1
1     2
2     1
3     4
4     4
     ..
95    3
96    2
97    4
98    4
99    3
Length: 100, dtype: uint32 0     1
1     1
2     2
3     3
4     3
     ..
95    1
96    2
97    1
98    2
99    2
Length: 100, dtype: uint32 0     26260
1     10717
2     17812
3     23432
4     20499
      ...
95    16470
96    29610
97    14929
98    22227
99    26027
Length: 100, dtype: uint32

In [3]:
housemkt = pd.concat([s1, s2, s3],axis=1)
housemkt.head()

   0  1      2
0  1  1  26260
1  2  1  10717
2  1  2  17812
3  4  3  23432
4  4  3  20499

In [5]:
housemkt.rename(columns = {0:'bedrs',1:'bathrs',2:'price_sqr_meter'},inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            26260
1      2       1            10717
2      1       2            17812
3      4       3            23432
4      4       3            20499

In [6]:
bigcolumn = pd.concat([s1, s2],axis=0)
bigcolumn= bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

    0
0   1
1   2
2   1
3   4
4   4
.. ..
95  1
96  2
97  1
98  2
99  2

[200 rows x 1 columns]

In [9]:
len(bigcolumn)
300

300

In [10]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

     0
0    1
1    2
2    1
3    4
4    4
..  ..
195  1
196  2
197  1
198  2
199  2

[200 rows x 1 columns]